{"data":{"markdownRemark":{"fields":{"slug":"/2019-04-01-ionic2-security-for-cordova-mobile-applications/"},"frontmatter":{"title":"Ionic2 - Security for Cordova mobile applications","date":"18 February 2017","excerpt":"One of the great challenge for mobile developers is securing it. In case of Cordova based mobile applications, this challenge is more complex. Since, all the cordova based mobile applications are nothing but an website with index.html. The only difference here is that this website runs within your mobile and all the html pages are wrapped within native container of mobile platforms.","tags":["angular","cordova","ionic","security","whitelist"]},"html":"<p> One of the great challenge for mobile developers is securing it. In case of Cordova based mobile applications, this challenge is more complex. Since, all the cordova based mobile applications are nothing but an website with index.html. The only difference here is that this website runs within your mobile and all the html pages are wrapped within native container of mobile platforms.</p>\n<p>Let's look at the some of the points to be taken care while securing your mobile application:</p>\n<h2><a href=\"https://cordova.apache.org/docs/en/latest/guide/appdev/whitelist/\">Cordova Whitelist Plugin</a></h2>\n<p>This helps in restricting the access from your application to external websites. It prevents attackers to get information about user by injecting their own javascript code into your application. By default access policy is set to allow access for all domains.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;access origin=&quot;*&quot; /&gt;</code></pre></div>\n<p>Change this to point only to your site</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;access origin=&quot;https://yoursite.com/&quot; /&gt;</code></pre></div>\n<h2><strong>Transfer Data Using Https:</strong></h2>\n<p>Data transferred over http can be intercepted and altered, but data sent over https can not be intercepted and altered.</p>\n<h2><strong>Don't Store Sensitive information in LocalStorage</strong></h2>\n<p>One of the biggest mistake that is being done by hybrid developers is that many of them store sensitive information like username and password into the localstorage. Localstorage of one application can be accessed  by the other application. It's like storing username and password into browser, which is of course not advisable.</p>\n<p>Instead of storing username and password, try storing tokens such as JWT tokens. One thing to take care is that, do not use password while creating JWT tokens. Since JWT tokens are a key, which can be intercepted by attacker, but then also it does not provide any sensitive information to attacker. JWT tokens does not contain any sensitive information about user. They are just use to authenticate users.  Although, if someone was able to get JWT tokens, they can log on behalf of user, We need to consider this while developing our application.</p>\n<h2>Use Authentication Service</h2>\n<p>You can also develop your own authentication  service for mobile application. It should also be taken care that, developing an own authentication service is difficult task as w need to take about a lot of security perspectives. You can use Social providers such as Google, Facebook, Github etc. for authenticating users. There are also Services like Auth0 or OAuth which can be used to secure your application.</p>\n<p>You can also integrate your server with <a href=\"http://docs.ionic.io/services/auth/\">Ionic Auth</a> for authentication purpose.</p>\n<p>Hope this post would have given you clear understanding about authentication in hybrid mobile applications., white</p>","id":"6bdc9eca-1f28-5a5b-83f6-833b540ca057"}},"pageContext":{"pathSlug":"/2019-04-01-ionic2-security-for-cordova-mobile-applications/","next":{"fields":{"slug":"/2019-04-01-ionic2-internationalization-using-ng2-translate/"},"frontmatter":{"title":"Ionic2 - Internationalization using ng2-translate"},"fileAbsolutePath":"/media/nitish/3E1698381697EEE1/Practice/blog.nitishkumarsingh.xyz/posts/2019-04-01-ionic2-internationalization-using-ng2-translate.md"},"previous":{"fields":{"slug":"/2019-03-31-ionic2-secure-storage-in-mobile-application/"},"frontmatter":{"title":"Ionic2 - Secure Storage in mobile application"},"fileAbsolutePath":"/media/nitish/3E1698381697EEE1/Practice/blog.nitishkumarsingh.xyz/posts/2019-03-31-ionic2-secure-storage-in-mobile-application.md"}}}