{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"55c3994c-7eea-53b5-97bc-7a4b46df155e","excerpt":"There has been always pretty much hype around serverless from the day one. Although, all the workload is only going to run on servers itself…","fields":{"slug":"/2019-08-04-introduction-of-google-cloud-run/"},"frontmatter":{"title":"Introduction of Google Cloud Run","date":"04 August 2019","tags":["serverless","cloudrun","gcp","aws"],"excerpt":"Google Cloud Run is a managed service that enables you to run stateless containers that are invocable via web requests or Cloud Pub/Sub events. It manages all infrastructure management, so developers can focus on building applications."}}},{"node":{"id":"bf09224d-9fd4-5993-8d86-f10c855fbf30","excerpt":"import { Chart } from 'chart.js';In the world of data, visualization plays the important role. It helps the business to identify the various…","fields":{"slug":"/2019-04-01-ionic-using-chart-js/"},"frontmatter":{"title":"Ionic - Using Chart.js","date":"14 August 2017","tags":["angular","chartjs","ionic","cordova"],"excerpt":"In the world of data, visualization plays the important role. It helps the business to identify the various patterns. More and more of data visualization and data scientist professional are being required. With great demand in visualization, great tools and technologies are emerging too."}}},{"node":{"id":"e8e8c67d-4793-554c-a7d3-24cbdd377223","excerpt":"Gesture event support is also one of the reason behind popularity of mobile\napplications. Capturing gesture events can be easily done in…","fields":{"slug":"/2019-03-31-ionic2-hammer-js-example/"},"frontmatter":{"title":"Ionic2 - Hammer JS Example","date":"13 March 2017","tags":["angular","Cordova","gesture","Hammer.js","Ionic"],"excerpt":"Gesture event support is also one of the reason behind popularity of mobile applications. Capturing gesture events can be easily done in case of native mobile applications, since all the mobile platform expose gesture events in native code."}}},{"node":{"id":"1ea9fafc-aad2-5008-a999-90f9b776ed2e","excerpt":"Securing communication between mobile application and back-end server is crucial. We should authenticate the requests sent from mobile…","fields":{"slug":"/2019-03-31-ionic2-secure-storage-in-mobile-application/"},"frontmatter":{"title":"Ionic2 - Secure Storage in mobile application","date":"25 February 2017","tags":["cordova","ionic","security","secure-storage"],"excerpt":"Securing communication between mobile application and back-end server is crucial. We should authenticate the requests sent from mobile applications before serving them. Authentication may require username and password for the user, which most of the developers store into mobile local-storage.  Storing sensitive information in local-Storage is a very bad practice, instead you should use other options such as JWT tokens or Social providers."}}},{"node":{"id":"6bdc9eca-1f28-5a5b-83f6-833b540ca057","excerpt":" One of the great challenge for mobile developers is securing it. In case of Cordova based mobile applications, this challenge is more…","fields":{"slug":"/2019-04-01-ionic2-security-for-cordova-mobile-applications/"},"frontmatter":{"title":"Ionic2 - Security for Cordova mobile applications","date":"18 February 2017","tags":["angular","cordova","ionic","security","whitelist"],"excerpt":"One of the great challenge for mobile developers is securing it. In case of Cordova based mobile applications, this challenge is more complex. Since, all the cordova based mobile applications are nothing but an website with index.html. The only difference here is that this website runs within your mobile and all the html pages are wrapped within native container of mobile platforms."}}},{"node":{"id":"28f1d18c-9634-5593-a2f8-f7e3e90a692d","excerpt":"To target target people from different countries, i18n support is required for your mobile app . Here in India where there are so many local…","fields":{"slug":"/2019-04-01-ionic2-internationalization-using-ng2-translate/"},"frontmatter":{"title":"Ionic2 - Internationalization using ng2-translate","date":"10 February 2017","tags":["angular","ng2-translate","ionic","cordova"],"excerpt":"To target target people from different countries, i18n support is required for your mobile app . Here in India where there are so many local languages, i18n support in mobile apps is must."}}},{"node":{"id":"15b94fda-f1ec-5aca-8f9f-620f5f143a07","excerpt":"Note: Purpose for this post is just to show, how to correctly use D3 JS in Ionic2 During the UI/Mobile app development, we all would have…","fields":{"slug":"/2019-04-01-ionic2-how-to-use-d3-js/"},"frontmatter":{"title":"Ionic2 - How to use D3 JS","date":"03 February 2017","tags":["angular","cordova","ionic","d3","types"],"excerpt":"During the UI/Mobile app development, we all would have encountered need to use data visualization components. D3 JS is one of such powerful tool, being used for same."}}},{"node":{"id":"75cf200f-822f-5935-b550-d618d58c53d7","excerpt":"An attractive icon and splash screen are always important for your mobile    application. after all they are the first thing anyone will…","fields":{"slug":"/Ionic2-Cordova-Android-splash-screen-and-icon-is-not-working/"},"frontmatter":{"title":"Ionic2/Cordova - Android splash screen and icon is not working","date":"27 January 2017","tags":["angular","Cordova","Ionic"],"excerpt":"An attractive icon and splash screen are always important for your   mobileapplication. after all they are the first thing anyone will look into."}}}]}},"pageContext":{"pageNumber":0,"humanPageNumber":1,"skip":0,"limit":10,"numberOfPages":1,"previousPagePath":"","nextPagePath":""}}